{
  "Navbar": {
    "home": "Home",
    "about": "About",
    "work": "Work",
    "projects": "Projects",
    "documents": "Documents",
    "contact": "Contact"
  },
  "Footer": {
    "privacy": "Privacy Policy",
    "imprint": "Imprint",
    "contact": "Contact",
    "language": "Language",
    "language_en": "English",
    "language_de": "German"
  },
  "Home": {
    "welcome": "Hi, I'm Thomas Schwabauer!",
    "title": "Freelance Fullstack Developer",
    "location": "Wetzlar, Germany",
    "contact": "Contact",
    "learnMore": "Learn More",
    "orb_1": "Kotlin is a concise, modern programming language for Android and Java development.",
    "orb_2": "Docker simplifies creating, deploying, and running applications using containers.",
    "orb_3": "TypeScript is a strongly-typed superset of JavaScript that adds static types.",
    "orb_4": "Next.js is a React framework for building optimized, production-ready applications.",
    "orb_5": "Angular is a powerful platform for building scalable web applications.",
    "orb_6": "React is a popular JavaScript library for creating interactive user interfaces.",
    "orb_7": "Android is the world's leading mobile operating system, developed by Google.",
    "orb_8": "Flutter allows building natively compiled applications for mobile, web, and desktop.",
    "orb_9": "Java is a versatile, high-level programming language widely used for cross-platform development.",
    "orb_10": "Spring Boot simplifies building production-ready Java applications with minimal configuration."
  },
  "About": {
    "title": "About me",
    "whoAmI": "Who am I?",
    "description": "I'm a software developer experienced in building software, managing projects, testing applications, and providing customer support. My goal is to build high-quality, practical solutions while continuously learning.",
    "career": "Throughout my",
    "careerLink": "career",
    "careerProjects": ", I have contributed to projects for prominent customers such as ",
    "and": "and",
    "includingProjects": ", including web applications, mobile apps, and backend systems.",
    "niceToKnow": "Nice to know: I am {age} years old, live in Wetzlar, Germany and practice natural bodybuilding, which speaks to my dedication and discipline both personally and professionally.",
    "skillMatrix": "Skill Matrix",
    "frameworksLibraries": "Frameworks & Libraries",
    "programmingLanguages": "Programming Languages",
    "devOpsTools": "DevOps & Tools",
    "databasesApis": "Databases & APIs",
    "contactButton": "Contact Me"
  },
  "Contact": {
    "title": "Contact",
    "yourEmail": "Your Email",
    "emailPlaceholder": "example@domain.com",
    "topic": "Topic",
    "topicPlaceholder": "Topic of your message",
    "message": "Message",
    "messagePlaceholder": "Write your message here...",
    "sendMessage": "Send Message",
    "directEmail": "Or email me directly at:",
    "copied": "Copied!",
    "imageAlt": "Illustrative Image",
    "successTitle": "Thanks for contacting me! 😁",
    "successMessage": "I will reach out to you very soon.",
    "errorTitle": "Something went wrong! 🥲",
    "errorMessage": "Seems like the line is busy. Please try again later or reach out to me via email at {email}.",
    "goHome": "Go Home",
    "close": "Close",
    "errors": {
      "invalidEmail": "Please enter a valid email address",
      "topicRequired": "Topic is required",
      "messageMin": "Message must be at least 5 characters long"
    }
  },
  "Documents": {
    "title": "Documents / Certificates",
    "viewDocument": "View Document",
    "viewDocumentLang": "View {language} Document",
    "bachelorTitle": "Bachelor of Science (B.Sc.)",
    "bachelorDescription": "Bachelor's program: computer science",
    "cvTitle": "Curriculum Vitae",
    "cvDescription": "My latest CV available in both English and German.",
    "blockchainTitle": "Blockchain Expert - Certificate of completion",
    "blockchainDescription": "Solidity, web3.js, Ethereum, Hardhat, Truffle",
    "springBootTitle": "Spring Boot & Hibernate for Beginners",
    "springBootDescription": "Java, Spring Boot, Hibernate, REST-API, CRUD, JPA, AOP",
    "language": {
      "english": "English",
      "german": "German"
    }
  },
  "Projects": {
    "title": "My Projects",
    "technologies_used": "Technologies Used",
    "planningPokerDescription": "A free Online Planning Poker Website",
    "planningPokerTechnologies": "Next.js, React.js, TypeScript, Firebase Realtime Database, Tailwind, Shadcn/ui",
    "myDexDescription": "A fully decentralized Exchange deployed on the Sepolia Testnet, including the Solidity smart contracts.",
    "myDexTechnologies": "React, Solidity, Hardhat, Foundry",
    "perionDashboardDescription": "A dashboard portfolio which grabs daily data for crypto prices and other relevant web3 meta data",
    "perionDashboardTechnologies": "React.js, TypeScript, APIs, Cron",
    "portfolioDescription": "My portfolio website",
    "portfolioTechnologies": "React, TypeScript, Tailwind",
    "viewProject": "View Project",
    "viewSource": "View Source"
  },
  "Work": {
    "title": "Work Experience",

    "freelancerCompany": "Freelancer",
    "freelancerRole": "Fullstack Senior Developer | Testautomation | Android",
    "freelancerDuration": "Oct 2023 - Today",
    "freelancerLocation": "Wetzlar",
    "freelancerBullet1": "I am eager to expand my contributions in this area as I begin my journey and look forward to the valuable experiences ahead.",

    "amselCompany": "Amsel UG",
    "amselRole": "CTO - Flutter, Spring Boot, TypeScript, Java, Firebase",
    "amselDuration": "Jul 2023 - Today",
    "amselLocation": "Langgöns",
    "amselBullet1": "Expertise in the planning and implementation of complex software projects",
    "amselBullet2": "Extensive knowledge in the evaluation and implementation of new technologies",
    "amselBullet3": "Good understanding of Flutter framework and Dart programming",
    "amselBullet4": "Backend Development with Java / Spring-Boot",

    "vmCompany": "Valtech-Mobility GmbH",
    "vmRole": "Consultant - Angular, TypeScript, Android, Kotlin, Java",
    "vmDuration": "Mar 2023 - Sep 2024",
    "vmBullet1": "Responsible for direct cooperation and customer care as well as the maintenance of business relationships",
    "vmBullet2": "Project management of consulting projects, including time planning and resource management",
    "vmBullet3": "Development of in-car apps with Android Automotive and Java/Kotlin",
    "vmBullet4": "Development of web applications with Angular and Typescript",

    "alcedisCompany": "Alcedis GmbH",
    "alcedisRole": "Software developer - TypeScript, PHP, Laravel, React.js, Flutter, Docker, Kubernetes",
    "alcedisDuration": "Jul 2020 - Feb 2023",
    "alcedisBullet1": "Development of automation tests for web applications in an agile environment",
    "alcedisBullet2": "Integration of test automation into the development process",
    "alcedisBullet3": "3 years of experience in the development of web applications with HTML, CSS, Laravel, PHP, React, TypeScript, Docker",
    "alcedisBullet4": "Experience in implementing and managing containers with Docker and Kubernetes.",

    "alcedisTesterCompany": "Alcedis GmbH",
    "alcedisTesterRole": "Software tester",
    "alcedisTesterDuration": "Jun 2018 - Jul 2020",
    "alcedisTesterBullet1": "Creation and maintenance of test documentation",
    "alcedisTesterBullet2": "Execution of manual functional and regression tests",
    "alcedisTesterBullet3": "Development and maintenance of automated test scripts for web applications",
    "alcedisTesterBullet4": "Collaborating with developers and other stakeholders to analyze errors"
  },
  "Privacy": {
    "title": "Privacy Policy",
    "introductionTitle": "Introduction",
    "introductionText": "Thank you for visiting my website! We are committed to protecting your personal data and respecting your privacy. This privacy policy will inform you about how we handle your data when you use our services.",
    "informationWeCollectTitle": "Information We Collect",
    "informationWeCollectText": "We collect information to improve our services and enhance your experience. The types of information we collect include:",
    "informationWeCollectItems": {
      "personalInfo": "Personal Identification Information (e.g., your name and email address) when provided by you voluntarily.",
      "usageData": "Usage Data such as your browser type, IP address, and how you interact with our website. This helps us analyze user behavior and improve our services."
    },
    "howWeUseYourDataTitle": "How We Use Your Data",
    "howWeUseYourDataText": "We use your data for the following purposes:",
    "howWeUseYourDataItems": {
      "personalize": "To personalize your experience on our website.",
      "provideServices": "To provide, operate, and maintain our services.",
      "improveFunctionality": "To improve the functionality and usability of our website.",
      "analyzeInteraction": "To analyze and understand how users interact with our services to enhance the overall experience.",
      "communicate": "To communicate with you, such as providing support or updates."
    },
    "googleAnalyticsTitle": "Google Analytics",
    "googleAnalyticsText": "We use Google Analytics, a web analytics service provided by Google LLC, to understand how visitors interact with our website. Google Analytics uses cookies to collect information about your use of the website, such as pages visited, time spent on the site, and referring websites. This data helps us analyze user behavior to improve the content and functionality of our website.",
    "googleAnalyticsOptOutText": "You can opt out of Google Analytics tracking by installing the ",
    "googleAnalyticsOptOutLinkText": "Google Analytics Opt-Out Browser Add-on",
    "googlePrivacyPolicyLinkText": "Google Privacy Policy ",
    "cookiesTitle": "Cookies",
    "cookiesText": "Our website uses cookies to improve your browsing experience. Cookies are small files stored on your device that help us understand your preferences and how you interact with our website. By using our website, you consent to the use of cookies. If you do not wish to use cookies, you can disable them in your browser settings, though some features of our website may not function properly without them.",
    "thirdPartySharingTitle": "Third-Party Sharing",
    "thirdPartySharingText": "We do not sell, trade, or transfer your personal data to third parties, except where it is necessary to provide services or comply with legal requirements. Google Analytics is the only third-party service provider involved, and data collected through Google Analytics may be processed by Google to provide web analytics services.",
    "securityOfInformationTitle": "Security of Your Information",
    "securityOfInformationText": "We take the security of your personal information seriously and use commercially acceptable measures to protect it. However, please note that no method of transmission over the internet or electronic storage is 100% secure.",
    "yourRightsTitle": "Your Rights",
    "yourRightsText": "You have the right to access, update, or delete your personal information. If you wish to exercise any of these rights, please contact us at {email}.",
    "changesToPolicyTitle": "Changes to This Privacy Policy",
    "changesToPolicyText": "We may update this privacy policy from time to time to reflect changes in our practices or services. The updated policy will be posted on this page, and the effective date will be revised accordingly.",
    "contactUsTitle": "Contact Us",
    "contactUsText": "If you have any questions regarding this privacy policy or how we handle your personal information, please contact us at: "
  },
  "Imprint": {
    "title": "Imprint",
    "informationSectionTitle": "Information According to § 5 TMG",
    "contactTitle": "Contact",
    "contactPhone": "Phone",
    "contactEmail": "Email",
    "vatIdTitle": "VAT ID",
    "vatIdText": "VAT identification number according to § 27 a of the German VAT Act",
    "disclaimerTitle": "Disclaimer",
    "accountabilityForContentTitle": "Accountability for content",
    "accountabilityForContentText": "The contents of our pages have been created with the utmost care. However, we cannot guarantee the contents' accuracy, completeness, or topicality. According to statutory provisions, we are furthermore responsible for our own content on these web pages. In this context, please note that we are not obliged to monitor the transmitted or saved information of third parties, or investigate circumstances pointing to illegal activity.",
    "accountabilityForLinksTitle": "Accountability for links",
    "accountabilityForLinksText": "Responsibility for the content of external links (to web pages of third parties) lies solely with the operators of the linked pages. No violations were evident to us at the time of linking. Should any legal infringement become known to us, we will remove the respective link immediately.",
    "privacyPolicyTitle": "Privacy Policy",
    "privacyPolicyText1": "This website uses Google Analytics, a web analytics service provided by Google LLC. Google Analytics uses \"cookies\", which are text files placed on your computer, to help the website analyze how users interact with the site. The information generated by the cookie about your use of the website will be transmitted to and stored by Google on servers in the United States. We use this information to evaluate your use of the website, compile reports on website activity, and provide other services related to website activity and internet usage. You can prevent Google Analytics from using your data by installing the opt-out browser add-on provided by Google.",
    "privacyPolicyText2": "For more information on how Google handles your data, please refer to their",
    "googlePrivacyPolicyLinkText": "privacy policy",
    "creditsTitle": "Credits",
    "creditsText": "Built by",
    "creditsYear": "in 2024",
    "germany": "Germany"
  },
  "Cookie": {
    "title": "I use cookies on this site",
    "description": "I use cookies to ensure you have the best possible experience on my website. For more details on how these cookies are used, please check out my cookie policy. By clicking \"Accept\", you agree to the use of cookies.",
    "learnMore": "Learn more.",
    "accept": "Accept",
    "decline": "Decline",
    "titleSmall": "I use cookies",
    "descriptionSmall": "I use cookies to make sure you have the best possible experience on my website. For more information, you can check out my cookie policy."
  }
}
